<?php

return array(

    'custom-welcome-panel' => true,

    /*
    |--------------------------------------------------------------------------
    | full width panel
    |--------------------------------------------------------------------------
    | 全宽面板
    |
    */
    'full-width-panel' => true,

    /*
    |--------------------------------------------------------------------------
    | dashboard right now
    |--------------------------------------------------------------------------
    | 仪表盘“概览”小工具支持自定义内容类型
    |
    */
    'glance-box-extend' => true,
    
    /*
    |--------------------------------------------------------------------------
    | Support
    |--------------------------------------------------------------------------
    | 技术支持
    |
    */

    'support' => false,

    /*
    |--------------------------------------------------------------------------
    | Status
    |--------------------------------------------------------------------------
    | 状态
    |
    */

    'status' => true,

    /*
    |--------------------------------------------------------------------------
    | Dashboard Feed
    |--------------------------------------------------------------------------
    | 聚合订阅内容
    |
    */

    'feeds' => array(

        array(
            'name'      => __('Piklist新闻','BT_TEXTDOMAIN'),
            'id'        => 'dashboard-piklist-rss',
            'rss'       => 'https://piklist.com/feed/',
            'priotirty' => 'core',
            'type'      => 'side',
            'excerpt'   => true,
            'limit'     => 5,
        ),

        array(
            'name'      => __('WP大学新闻','BT_TEXTDOMAIN'),
            'id'        => 'dashboard-wpdaxue-rss',
            'rss'       => 'https://www.wpdaxue.com/feed/',
            'priotirty' => 'core',
            'type'      => 'normal',
            'excerpt'   => false,
            'limit'     => 5,
        ),

    ),

    /*
    |--------------------------------------------------------------------------
    | remove dashboard widgets
    |--------------------------------------------------------------------------
    | 删除小工具
    |
    */
    'remove-widgets' => array(
        'woocommerce_dashboard_recent_reviews', // WooCommerce最新评价
        'woocommerce_dashboard_status', // WooCommerce 状态
    ),

);
