<?php

return array(

    /*
    |--------------------------------------------------------------------------
    | 网站前后台设置不同语言
    |--------------------------------------------------------------------------
    |
    | http://blog.wpjam.com/m/setup-different-admin-and-frontend-language-on-wordpress/
    |
    */

    'different-admin-and-frontend-language' => false,
    
    /*
    |--------------------------------------------------------------------------
    | 网站前台语言
    |--------------------------------------------------------------------------
    | example: 'zh_CN','en_US'
    */

    'frontend-language' => 'en_US',

);